package holiday

import "time"

// 法定节假日：持续补充
var LegalHolidays = map[string]string{
	"2024-10-01": "国庆节",
	"2024-10-02": "国庆节",
	"2024-10-03": "国庆节",
	"2024-10-04": "国庆节",
	"2024-10-05": "国庆节",
	"2024-10-06": "国庆节",
	"2024-10-07": "国庆节",

	// 2025年上半年法定节假日
	"2025-01-01": "元旦",
	"2025-01-28": "春节",
	"2025-01-29": "春节",
	"2025-01-30": "春节",
	"2025-01-31": "春节",
	"2025-02-01": "春节",
	"2025-02-02": "春节",
	"2025-02-03": "春节",
	"2025-02-04": "春节",
	"2025-04-04": "清明节",
	"2025-04-05": "清明节",
	"2025-04-06": "清明节",
	"2025-05-01": "劳动节",
	"2025-05-02": "劳动节",
	"2025-05-03": "劳动节",
	"2025-06-29": "端午节",
	"2025-06-30": "端午节",
}

// 普通节日
var NormalHolidays = map[string]string{
	"02-14": "情人节",
	"03-08": "妇女节",
	"03-12": "植树节",
	"04-01": "愚人节",
	"05-04": "青年节",
	"06-01": "儿童节",
	"07-01": "建党节",
	"08-01": "建军节",
	"09-10": "教师节",
	"12-24": "平安夜",
	"12-25": "圣诞节",
}

func IsWeekend(t time.Time) bool {
	// time.Weekday() 返回 0-6，0 表示周日，6 表示周六
	weekday := t.Weekday()
	return weekday == time.Saturday || weekday == time.Sunday
}

func IsWorkday(t time.Time) bool {
	return !IsWeekend(t)
}
